Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ཐམས་ཅད་སེམས་ཅན་མེད་པར་ཡང་རབ་ཏུ་ཤེས་ལ། སེམས་ཅན་གྱི་ཁམས་གདུལ་བའི་ཚུལ་ལས་ཀྱང་མྱི་ལྡོག་པ་དང་། ཆོས་ཐམས་ཅད་མ་སྐྱེས་པ་དང་། མ་འགགས་པར་ཡང་ཁོང་དུ་ཆུད་ལ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བའི་སྦྱོར་བ་ལས་ཀྱང་ཕྱིར་མྱི་ལྡོག་པ་དང་། ཆོས་ཐམས་ཅད་ལ་ལས་དང་རྣམ་པར་སྨྱིན་པ་མ་མཆིས་པར་ཡང་རྟོགས་ལ།
en: They know that all beings are without existence, but they do not turn away from the ways of guiding the realm of beings; they comprehend that all phenomena are unborn and unceasing, but they do not abandon engaging in making offerings to and venerating all the tathāgatas; and they realize that there is no karma and ripening within all phenomena, but they do not turn away from engagement in accomplishing good actions.”

source: དགེ་བའི་ལས་མངོན་པར་འདུ་བྱ་བའི་སྦྱོར་བ་ལས་ཀྱང་། ཕྱིར་མི་ལྡོག་པ་མ་འཚལ་ཏོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་། ཤཱཀྱའི་བུ་མོ་གོ་པས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཆོས་ཉིད་རྣམ་པ་དེ་ལྟ་བུས་དྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །
en: Gopā, the Śākya maiden, said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you intended to ask in that way about the nature of bodhisattva conduct.

source: དྲི་བ་བརྗོད་པ་དེ་དག་ཀྱང་ཀུན་ཏུ་བཟང་པོའི་སྨོན་ལམ་དང་སྤྱོད་པ་ལ་མངོན་དུ་གྱུར་པའི་ཚིག་གོ །
en: Those questions are also the words of the completely good prayer and conduct.

source: རིགས་ཀྱི་བུ་དེ་བས་ན་ལེགས་པར་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་བསྟན་པར་བྱའོ།
en: “Therefore, noble one, listen carefully and remember, for I shall teach through the blessing of the Buddha.

source: རིགས་ཀྱི་བུ། ཆོས་བཅུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་འདི་ལྟ་བུ་མིག་འཕྲུལ་གྱི་གཞིའི་དཔེ་དང་འདྲ་བ། ཡེ་ཤེས་ཀྱི་འོད་ཀུན་ཏུ་འབྱུང་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Noble one, the bodhisattvas who have ten qualities such as these fulfill the bodhisattva conduct that is like the appearance of magical illusions and gives rise to the light of wisdom.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། དགེ་བའི་བཤེས་གཉེན་རླབས་པོ་ཆེ་ལ་བརྟེན་པ་དང་། མོས་པ་རྒྱ་ཆེན་པོ་རབ་ཏུ་ཐོབ་པ་དང་།
en: “What are these ten?

source: དགེ་བའི་བསམ་པ་རླབས་པོ་ཆེ་རྣམ་པར་དག་པ་དང་། བསོད་ནམས་དང་ཡེ་ཤེས་རྒྱ་མཚོ་ཡངས་པས་རབ་ཏུ་བརྟན་པའི་སེམས་དང་། སངས་རྒྱས་སྐྱེ་བ་འབྱུང་བའི་ཆོས་བསྟན་པ་ཆེན་པོ་ཐོས་པ་རབ་ཏུ་ཐོབ་པ་དང་། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ལ་མོས་པའི་སེམས་ཀྱིས་གནས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་བརླབས་རབ་ཏུ་ཐོབ་པ་དང་། རང་བཞིན་གྱིས་སྙིང་རྗེ་ཆེན་པོའི་ལྷག་པའི་བསམ་པ་རྣམ་པར་དག་པ་དང་། འཁོར་བའི་འཁོར་ལོ་ཐམས་ཅད་རབ་ཏུ་གཅད་རབ་ཏུ་གཅད་པའི་སེམས་ཀྱི་སྟོབས་ཤུགས་དྲག་པོ་དང་ལྡན་པ་རབ་ཏུ་ཐོབ་པ་སྟེ།
en: They are (1) reliance on sublime kalyāṇamitras, (2) the attainment of a vast aspiration, (3) a pure, sublime virtuous motivation, (4) a mind supported by a vast ocean of merit and wisdom, (5) being able to hear great teachings of the Dharma that has originated and arisen from the buddhas, (6) the attainment of aspiration toward the tathāgatas of the three times, (7) the comprehension of the equality of all the fields of bodhisattva conduct, (8) the attainment of the blessing of all the tathāgatas, (9) the natural, pure, higher motivation of great compassion, and (10) that attainment of the strong power of the motivation to end the continuation of all the cycles of saṃsāra.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པ་འདི་ལྟ་བུ་མིག་འཕྲུལ་གྱི་གཞིའི་དཔེ་དང་འདྲ་བ་འོད་ཀུན་ཏུ་འབྱུང་བ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །
en: “Noble one, the bodhisattvas who have those ten qualities fulfill the bodhisattva conduct that is like the appearance of magical illusions and gives rise to the light of wisdom.

source: རིགས་ཀྱི་བུ་དེ་ལ་བརྩོན་འགྲུས་ཕྱིར་མྱི་ལྡོག་པ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཆོས་དེ་དག་ཐོབ་པར་གྱུར་ནས་ཀྱང་མི་ཟད་པའི་ཚུལ་དུ་མངོན་པར་སྒྲུབ་ཅིང་། བསྒོམ་པ་དང་ཤིན་ཏུ་རྒྱ་ཆེ་བར་བྱ་བའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་ཅིང་རྣམ་པ་བཅུས་མངོན་པར་དགའ་བར་བྱེད་དོ། །
en: “Noble one, the bodhisattvas with nonregressing diligence who have obtained those ten qualities, in order to accomplish an inexhaustible way and practice an extremely vast meditation, serve the kalyāṇamitras and please them in ten ways.

source: བཅུ་གང་ཞེ་ན་འདི་ལྟ་སྟེ། ལུས་དང་སྲོག་ལ་ཕོངས་པར་མི་རྩི་བ་དང་། འཁོར་བའི་ཡོ་བྱད་དོན་དུ་མི་གཉེར་བ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པ་ཉིད་དུ་ཁོང་དུ་ཆུད་པ་དང་།
en: “What are those ten ways?

source: ཐམས་ཅད་མཁྱེན་པའི་སྨོན་ལམ་ལས་ཕྱིར་མི་ལྡོག་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བ་དང་། སྲིད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་ཡིད་དང་། གནས་མེད་པའི་ཆོས་ཀྱི་ནམ་མཁའ་ལ་མི་གནས་མི་རྟེན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ལ་བསྒྲིབས་པ་མེད་པ་དང་།
en: They are (1) having no concern for one’s own life and body, (2) having no interest in the requisites of saṃsāra, (3) having the comprehension of the equality of all phenomena, (4) having an irrevocable prayer for omniscience, (5) observing all the ways of the realm of the Dharma, (6) having a mind that rises above the entire ocean of existences, (7) having no dependence or location within the space of the locationless Dharma, (8) having all the unobscured prayers of a bodhisattva, (9) pervading the entire ocean of realms, and (10) having the purified unobscured field of the knowledge of a bodhisattva.

source: ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རབ་ཏུ་འདུལ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་བསྒྲིབས་པ་མེད་པ་ཤིན་ཏུ་སྦྱངས་བ་སྟེ། རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་དགེ་བའི་བཤེས་གཉེན་བསྙེན་བཀུར་ཅིང་མངོན་པར་དགའ་བར་བྱེད་དོ། །དེ་ནས་ཤཱཀྱའི་བུ་མོ་གོ་པས་དོན་དེ་ཉིད་ཡོངས་སུ་བསྟན་པར་བྱ་བའི་ཕྱིར།
en: “Noble one, the bodhisattvas who have those ten qualities serve and please the kalyāṇamitras.”

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་ཕྱོགས་བཅུར་བལྟས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །རླབས་ཆེན་དྲི་མེད་བློ་ལྡན་གཞན་གྱི་དོན་ཞུགས་ཤིང་། དགེ་བཤེས་དམ་པ་བསྙེན་བརྩོན་གཡོ་དང་སྒྱུ་མེད་པ། །སྟོན་པའི་འདུ་ཤེས་ཐོབ་ཅིང་སྐྱོ་མེད་བརྩོན་འགྲུས་ཅན། །དེ་དག་སྤྱོད་པ་འཇིག་རྟེན་མིག་འཕྲུལ་འདྲ་འདི་ཡིན། །
en: Then the Śākya maiden Gopā, in order to teach the meaning of that, through the blessing of the buddhas looked into the ten directions and recited these verses: “Those sublime, stainless, wise ones engaged in benefiting others, Dedicated without deceit or deception to serving excellent friends, Recognizing them as teachers and having unflagging diligence— They carry out in the world this conduct that is like a magical apparition.

source: གང་རྣམས་མོས་པ་རླབས་ཆེན་མཁའ་དང་འདྲ་ལྡན་ཞིང་། །དེའི་ཁོངས་སུ་དུས་གསུམ་འཇིག་རྟེན་ཆུད་པ་དང་། །ཞིང་དང་སེམས་ཅན་ཆོས་དང་སངས་རྒྱས་དེ་བཞིན་པ། །
en: {11} “There are those who have sublime motivation as vast as space Within whom is contained the worlds of the three times, Realms, beings, phenomena, and likewise the buddhas.

source: ཡེ་ཤེས་འོད་བྱེད་སྤྱོད་པ་དེ་དག་འདི་ཡིན་ནོ། །
en: This is the conduct of those who shine with wisdom.

source: གང་རྣམས་བསམ་པ་མཁའ་འདྲ་མཐའ་དང་དབུས་མེད་ལ། །ཀུན་ནས་ཉོན་མོངས་དྲི་མས་མ་གོས་རབ་དག་ཅིང་། །དེ་བཞིན་གཤེགས་པ་ཀུན་གྱི་ཡོན་ཏན་འབྱུང་གྱུར་པ། །
en: {12} “There are those whose motivation is like space, without end or middle, Who are completely pure, unstained by the kleśas, And who give rise to the qualities of all the tathāgatas.

source: དེ་དག་སྤྱོད་པ་མིག་འཕྲུལ་གཞི་ཡི་རྣམ་པ་འདྲ། །
en: Their conduct is like the appearance of magical apparitions.

source: ཀུན་མཁྱེན་ཡེ་ཤེས་རྣམ་ཡངས་ཚད་མེད་བསམ་ཡས་དག །ཡོན་ཏན་རྒྱ་མཚོས་ཡིད་གསལ་ལྡན་པ་ཉེར་བརྟན་པ། །
en: {13} “There are those who have clear minds and an ocean of qualities And are established in vast, limitless, inconceivable, omniscient wisdom.

source: དེ་དག་བསོད་ནམས་རྒྱ་མཚོའི་ལུས་དང་སྙིང་པོ་སྟེ། །འཇིག་རྟེན་སྤྱོད་ཀྱང་འཇིག་རྟེན་དྲི་མས་གོས་མི་འགྱུར། །
en: They have bodies that have an ocean of merit and a pure essence That is unstained by worldly impurities even though they act within the world.

source: རྒྱལ་བའི་གསུང་གི་ཡན་ལག་སྒྲ་སྐད་ཚུལ་ཀུན་གྱིས། །ཆོས་ཀྱི་འབྲུག་སྒྲ་ཉན་ཀྱང་གང་རྣམས་མི་ངོམས་ཤིང་། །ཆོས་ཚུལ་རྗེས་སུ་སྙེགས་པའི་ཤེས་རབ་འོད་ཀྱི་སྒྲོན། །
en: {14} “There are those who never have enough of listening to the thunder of the Dharma That has the aspects of the speech of the jinas and all the ways of languages And who are lamps of the light of wisdom, which follow the way of the Dharma.

source: དེ་དག་འགྲོ་བར་འོད་གསལ་བྱེད་པའི་སྤྱོད་འདི་ཡིན། །
en: This is the conduct of those who bring illumination to beings.

source: གང་རྣམས་ཕྱོགས་བཅུའི་དེ་བཞིན་གཤེགས་པ་ཚད་མེད་པ། །གཞན་དང་གཞན་དག་སེམས་ཀྱི་སྐད་ཅིག་ཀུན་སེམས་ཤིང་། །བདེ་གཤེགས་རྒྱ་མཚོ་ཐམས་ཅད་ལྟ་ཞིང་ཤེས་བྱེད་པ། །
en: {15} “There are those who comprehend in each instant of the mind Each one of the countless tathāgatas in the ten directions, And they see and know the entire ocean of sugatas.

source: སངས་རྒྱས་སེམས་ལྡན་དེ་དག་སྤྱོད་ཡུལ་འདི་ཡིན་ནོ། །
en: This is the conduct of those who keep the buddhas in mind.

source: རྒྱལ་བ་རྣམས་ཀྱི་རྣམ་པར་ཡངས་པའི་འཁོར་མཐོང་ཞིང་། །དེ་དག་ཏིང་ངེ་འཛིན་ཚུལ་རྒྱ་མཚོ་མང་པོ་དང་། །སྨོན་ལམ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་ཚུལ་འཇུག་པ། །
en: {16} “There are those who see the vast assemblies of followers of the jinas And who comprehend the ocean of their ways of samādhi And the ways of their vast ocean of prayers with no end or middle.

source: མིག་འཕྲུལ་ལྟ་བུ་དེ་དག་སྤྱོད་པ་འདི་ཡིན་ནོ། །
en: This conduct of theirs is like the appearance of illusions.

source: ཕྱོགས་བཅུའི་རྒྱལ་བ་མ་ལུས་ཀུན་གྱིས་བྱིན་བརླབས་ཏེ། །ཕྱི་མཐའི་བསྐལ་བར་སྤྱོད་བྱེད་ཀུན་ཏུ་བཟང་པོ་རྣམས། །ཞིང་རྣམས་འབྱམ་ཀླས་ཀུན་ཏུ་གཟུགས་བརྙན་བྱུང་གྱུར་བ། །
en: {17} “There are those who have been blessed by every jina in the ten directions, Who have the completely good conduct till the final kalpa, And whose images appear throughout the vast extent of the realms.

source: ཆོས་འོད་བྱེད་པ་དེ་དག་སྤྱོད་པ་འདི་ཡིན་ནོ། །
en: This is the conduct of those who bring the light of the Dharma.

source: གང་རྣམས་ཡེ་ཤེས་ཉི་མའི་སྙིང་རྗེའི་དཀྱིལ་འཁོར་ཅན། །འགྲོ་བ་ཉམ་ཉེས་མཐོང་ཞིང་ཆོས་ཀྱི་འོད་སྣང་བས། །འགྲོ་བའི་མུན་པ་བསྩལ་ཅིང་བསྟན་པ་འཆར་འབྱུང་བ། །
en: {18} “There are those who have the disk of the sun of compassion, Who, seeing beings in distress, illuminate them with the Dharma’s light, Clear away the darkness of beings, and cause the teachings to shine.

source: ཉི་མ་ལྟ་བུར་དེ་དག་སྤྱོད་པ་འདི་ཡིན་ནོ། །
en: This is the conduct of those who are like the sun.

source: སྐྱེ་དགུ་སྲིད་པའི་རྒྱུད་ན་འགྲོ་ལྡོག་མཐོང་གྱུར་ནས། །ཡིད་གསལ་འཁོར་བའི་རྒྱུད་རྣམས་ཕྱིར་ཟློག་རབ་གནས་ཤིང་། །ཆོས་ཀྱི་འཁོར་ལོ་ཀུན་ནས་ཡོངས་སུ་སྒྲུབ་བྱེད་པ། །
en: {19} “There are those who see beings circling through existences, And those clear-minded ones remain, countering saṃsāra’s flow, And everywhere they bring about the wheel of the Dharma.

source: སྤྱོད་པ་ཀུན་བཟང་དམ་པའི་བློ་ཅན་རབ་ཏུ་སྤྱོད། །
en: They are practicing the wise, supreme, completely good conduct.

source: ཚུལ་འདིར་བསླབས་པ་དེ་དག་མཐའ་དང་དབུས་མྱེད་པའི། །ལུས་རྣམས་བསམ་པ་ཇི་བཞིན་འགྲོ་བར་ཉེར་བསྟན་ཏེ། །གཟུགས་བརྙན་མིག་ཡོར་འདྲ་བའི་རང་ལུས་ཚད་མེད་པས། །སྲིད་པའི་རྒྱ་མཚོ་དག་ན་འགྲོ་མང་ཡོངས་སྦྱིན་བྱེད། །
en: {20} “There are those who, training in this, manifest to beings, In accord with aspirations, bodies without limit or middle, Their countless bodies being like reflections or mirages, And they ripen many beings within the ocean of existences.

source: བྱམས་ཚུལ་ཤིན་ཏུ་ཡངས་པས་འགྲོ་མང་རྒྱས་བཀང་སྟེ། །མོས་པ་སྣ་ཚོགས་འགྲོ་ལ་རྣམ་པར་སྤྱོད་བསྟན་ནས། །འགྲོ་བར་བསམ་པ་ཇི་བཞིན་ཆོས་ཀྱི་ཆར་འབེབས་ཤིང་། །
en: {21} “There are those who are spreading among beings through the vast ways of love, Manifesting conducts to beings with various dispositions, And sending down a rain of Dharma in accordance with the aspirations of beings.

source: བརྟན་པ་བྱང་ཆུབ་དོན་དུ་སེམས་ཅན་ཁྲག་ཁྲིག་འདུལ། །
en: Those resolute ones guide billions of beings toward enlightenment.”

source: དེ་ནས་ཤཱཀྱའི་བུ་མོ་གོ་བས་ཚིགས་སུ་བཅད་པ་དེ་དག་སྨྲས་ནས།
en: {22} Those are the verses that Gopā, the Śākya maiden, recited.

source: ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་མོས་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཚུལ་ཐམས་ཅད་ལ་རྣམ་པར་བལྟ་བའི་ཡུལ་ཐོབ་པའོ། །
en: She then said to Sudhana, the head merchant’s son, “Noble one, I have attained the bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas.”

source: ནོར་བཟངས་ཀྱིས་སྨྲས་པ། འཕགས་མ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་ཚུལ་ལ་རྣམ་པར་ལྟ་བའི་ཡུལ་དེའི་ཡུལ་ཇི་ལྟ་བུ་ཞིག་མཆིས། སྨྲས་པ།
en: Sudhana asked, “Āryā, what is this bodhisattva liberation called the range of the view of all the ways of the ocean of the samādhis of the bodhisattvas like?”

source: རིགས་ཀྱི་བུ་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་འདི་ལ་སྙོམས་པར་ཞུགས་ན། འཇིག་རྟེན་གྱི་ཁམས་འདིའི་བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་མཐོང་ཞིང་ཁོང་དུ་ཆུད་དོ། །
en: Gopā answered, “Noble one, when I rest within this bodhisattva liberation, I see and comprehend as many kalpas in this world realm as there are atoms in countless buddha realms.

source: བསྐལ་པ་དེ་དག་གི་སེམས་ཅན་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་དུ་གཏོགས་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the existences of beings who are within that kalpa.

source: སེམས་ཅན་དེ་དག་གི་ཤི་འཕོ་དང་སྐྱེ་བའི་སྒོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །མངོན་པར་འགྲུབ་པའི་སྒོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་།
en: I also know all the gateways into death and rebirth of those beings.

source: ལས་མངོན་པར་འདུ་བྱེད་པ་ཡོངས་སུ་སྒྲུབ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དང་། ལས་རྣམ་པར་སྨྱིན་པ་སྣ་ཚོགས་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །དེ་དག་གི་ལས་ཡོངས་སུ་བླངས་པ་དགེ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །མི་དགེ་བ་དང་འབྱུང་བ་དང་མི་འབྱུང་བ་དང་། ངེས་པ་དང་མ་ངེས་པ་དང་།
en: I know all their entrances into becoming, all their acquisition of created karma, and all the various ripenings of their karma.

source: ལོག་པར་ངེས་པ་དང་། བག་ལ་ཉལ་བ་དང་བཅས་པ་དང་། བག་ལ་ཉལ་བ་མེད་པ་དང་།
en: I know all the karma acquired through good actions.

source: དགེ་བའི་རྩ་བ་ཕུན་སུམ་ཚོགས་པ་དང་། དགེ་བའི་རྩ་བ་རྒུད་པར་གྱུར་བ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་ཟིན་པ་དང་། མི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་ཟིན་པ་དང་། དགེ་བ་དང་མི་དགེ་བ་ཡོངས་སུ་ཟིན་པ་དང་། དེ་དག་གི་དགེ་བའི་ཆོས་ཡོངས་སུ་འདས་པ་དང་།
en: I know all the karma that is bad, that brings emancipation, that does not bring emancipation, that is definite, and that is indefinite; I know the definitely false, the latent, the nonlatent, the perfection of roots of merit, the loss of roots of merit, the retention of roots of merit, the retention of roots of demerit, the retention of roots of merit and demerit, the acquisition of good qualities, and the acquisition of bad qualities.

source: སྡིག་ཏོའི་ཆོས་ཡོངས་སུ་འདུས་པའི་ལས་ཡོངས་སུ་བླངས་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: “I know and comprehend all the buddha bhagavats that appear in those kalpas as numerous as the atoms in countless buddha realms.

source: བསྐལ་པ་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ལ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་གི་མཚན་རྒྱ་མཚོ་ཡང་ཤེས་ཤིང་ཁོང་དུ་ཆུད་དོ། །
en: I know and comprehend the ocean of their names.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཐུགས་དང་པོ་བསྐྱེད་པ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of the first developments of the aspiration to enlightenment by those buddha bhagavats.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཞུགས་པའི་ཚུལ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their ways of undertaking the attainment of omniscience.

source: སྨོན་ལམ་རྒྱ་མཚོ་ཐམས་ཅད་མངོན་པར་བསྒྲུབས་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the creation of their entire ocean of prayers.

source: སྔོན་གྱི་སངས་རྒྱས་བྱུང་བ་རྣམས་ཀྱི་དྲུང་དུ་གཤེགས་པ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their going into the presence of past buddhas.

source: སྔོན་གྱི་སངས་རྒྱས་ལ་མཆོད་ཅིང་རིམ་གྲོར་མཛད་པའི་སྦྱོར་བ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their engagements in offering to and serving past buddhas.

source: སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་རྫོགས་པར་མཛད་པ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their perfecting bodhisattva conduct in the past.

source: འབྱུང་བའི་རྒྱན་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their displays of setting forth.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་མཛད་པ་དང་། བཏུལ་བ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of the ripening and guiding of beings by those buddha bhagavats.

source: མངོན་པར་འཚང་རྒྱ་བར་མཛད་པ་རྒྱ་མཚོ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ocean of their attainment of buddhahood.

source: ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཁྱུ་མཆོག་གི་མཐུ་དང་རྣམ་པར་འཕྲུལ་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know miraculous manifestation and supremacy in turning the wheel of the Dharma.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the entire ocean of the miracles of those buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྣམ་པར་ཕྱེ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the categories of the assemblies of followers of those buddha bhagavats.

source: འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་དག་ན་ཉན་ཐོས་ཇི་སྙེད་ཅིག་འཁོད་པ་དེ་དག་གི་འབྱུང་བའི་ཚུལ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the śrāvakas present among those followers and their ways of setting forth.

source: སྔོན་གྱི་དགེ་བའི་རྩ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know their past roots of merit.

source: ལམ་བསྒོམས་པ་སྣ་ཚོགས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know their various meditations on the path.

source: ཡེ་ཤེས་ཐོབ་པར་བྱ་བ་ཕུན་སུམ་ཚོགས་ཤིང་རྣམ་པར་དག་པའི་བྱེ་བྲག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the categories of their pure, perfect attainment of wisdom.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་སེམས་ཅན་ཇི་སྙེད་ཅིག་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་བཀོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the beings that those tathāgatas established in the enlightenment of the pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གི་སྔོན་གྱི་དགེ་བའི་རྩ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the past roots of merit of those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གིས་རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཁོང་དུ་ཆུད་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the realization of pratyeka­buddha enlightenment by those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གི་ཞི་བའི་རྣམ་པར་སྤྱོད་པ་ལ་རྣམ་པར་རྩེ་བའི་རྣམ་པར་ཐར་པའི་སྒོ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the entrances to the liberation of the play of the peaceful conduct of those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གི་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the various miraculous manifestations of those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གིས་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the beings that are ripened by those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གི་ཆོས་བསྟན་པ་ཇི་སྙེད་ཅིག་བརྗོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the Dharma teachings that are taught by those pratyeka­buddhas.

source: རང་སངས་རྒྱས་དེ་དག་གི་ཏིང་ངེ་འཛིན་མཐའ་ཡས་པ་ལ་རྣམ་པར་སྤྱོད་ཅིང་རྣམ་པར་ཐར་པའི་སྒོ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་རྣམ་པར་བརྩེ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the infinite samādhis of the pratyeka­buddhas that they practice and the various entrances to liberations that they play in.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know all the parinirvāṇas of those buddha bhagavats.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཇི་སྙེད་པ་དེ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the entire ocean of the assemblies of bodhisattva followers of those buddha bhagavats.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གིས་ཐོག་མ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the first development of roots of merit by those bodhisattvas.

source: ཐོག་མ་སེམས་བསྐྱེད་པའི་སྨོན་ལམ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know their first development of the aspiration to enlightenment.

source: སྨོན་ལམ་རྣམ་པ་ཐ་དད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know their different prayers.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་འབྱུང་བའི་རྒྱན་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པ་རྣམ་པ་ཐ་དད་པ་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of their accomplishment of the displays of setting forth through bodhisattva conduct.

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་གྱི་ཡན་ལག་གི་ཚོགས་རྣམ་པར་དག་པར་བྱ་བ་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of their pure accumulation of the aspect of the path of the perfections.

source: བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་ནན་ཏན་དུ་བྱ་བའི་རྒྱན་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of their display of practicing the bodhisattva path.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་ཚོགས་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of their accumulations of ascending the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་ཤུགས་དྲག་པོ་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of the strong powers of ascending the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་བཟེམ་པའི་མཐུ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་དཀྱིལ་འཁོར་རྣམ་པ་ཐ་དད་པ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the different forms of the fields of samādhis that have the power to cause one to progress through the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོད་པས་རྣམ་པར་རྩེ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the miraculous displays on ascending the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་གནོན་པའི་རྣམ་པར་སྤྱོད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the conduct on ascending the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་རབ་ཏུ་གནས་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know being established on the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་བསྒོམ་པའི་རྒྱུད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the continuous meditation on the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་སྦྱང་བའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ways of purification on the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་ཡང་དག་པར་གནས་པར་བྱ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know dwelling on the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་སའི་མཚན་མ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the characteristics of the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་སའི་དབང་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the powers of the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ནས་སར་འཕར་བའི་ཡེ་ཤེས་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the wisdoms that cause ascent through the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་བསྡུ་བའི་ཡེ་ཤེས་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the wisdom that gathers together the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་ས་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the wisdom that ripens the bodhisattva bhūmis.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་དགོད་པ་ལ་ཡང་དག་པར་གནས་པར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the established states of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་གྱི་རྒྱ་ཡང་རབ་ཏུ་ཤེས་སོ། །
en: I know the vast field of conduct of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་རྣམ་པར་བརྩེ་བ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the miraculous displays of the conduct of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the oceans of the samādhis of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཚུལ་རྒྱ་མཚོ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the oceans of the liberations of bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཏིང་ངེ་འཛིན་རྒྱ་མཚོ་སྣ་ཚོགས་ཐོབ་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the attainment by bodhisattvas of various samādhis in each instant of mind.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སྣང་བའི་ཚུལ་ཐོབ་པར་བྱེད་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know their attainments of the ways of the illumination of omniscience.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གློག་གི་སྣང་བའི་སྤྲིན་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the clouds of light from the lightning of omniscience.

source: བྱང་ཆུབ་སེམས་དཔའི་བཟོད་པ་ཐོབ་པའི་ཚུལ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the ways of the attainment of the patience of bodhisattvas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འཇུག་པའི་ཡེ་ཤེས་ཀྱི་རྣམ་པར་གནོན་པ་དག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །
en: I know the prowess of immersion in omniscience.
